[
    {
        "id": 447365,
        "title": "Guardians of the Galaxy Vol. 3",
        "release_date": "2023-05-03",
        "poster_path": "/r2J02Z2OpNTctfOSN1Ydgii51I3.jpg",
        "overview": "Peter Quill, still reeling from the loss of Gamora, must rally his team around him to defend the universe along with protecting one of their own. A mission that, if not completed successfully, could quite possibly lead to the end of the Guardians as we know them."
    },
    {
        "id": 667538,
        "title": "Transformers: Rise of the Beasts",
        "release_date": "2023-06-06",
        "poster_path": "/gPbM0MK8CP8A174rmUwGsADNYKD.jpg",
        "overview": "When a new threat capable of destroying the entire planet emerges, Optimus Prime and the Autobots must team up with a powerful faction known as the Maximals. With the fate of humanity hanging in the balance, humans Noah and Elena will do whatever it takes to help the Transformers as they engage in the ultimate battle to save Earth."
    },
    {
        "id": 575264,
        "title": "Mission: Impossible - Dead Reckoning Part One",
        "release_date": "2023-07-08",
        "poster_path": "/NNxYkU70HPurnNCSiCjYAmacwm.jpg",
        "overview": "Ethan Hunt and his IMF team embark on their most dangerous mission yet: To track down a terrifying new weapon that threatens all of humanity before it falls into the wrong hands. With control of the future and the world's fate at stake and dark forces from Ethan's past closing in, a deadly race around the globe begins. Confronted by a mysterious, all-powerful enemy, Ethan must consider that nothing can matter more than his mission—not even the lives of those he cares about most."
    },
    {
        "id": 747188,
        "title": "Asteroid City",
        "release_date": "2023-06-09",
        "poster_path": "/qdq40gRS8xKnpFt5V75t6lUHgpx.jpg",
        "overview": "In an American desert town circa 1955, the itinerary of a Junior Stargazer/Space Cadet convention is spectacularly disrupted by world-changing events."
    },
    {
        "id": 335977,
        "title": "Indiana Jones and the Dial of Destiny",
        "release_date": "2023-06-28",
        "poster_path": "/Af4bXE63pVsb2FtbW8uYIyPBadD.jpg",
        "overview": "Finding himself in a new era, approaching retirement, Indy wrestles with fitting into a world that seems to have outgrown him. But as the tentacles of an all-too-familiar evil return in the form of an old rival, Indy must don his hat and pick up his whip once more to make sure an ancient and powerful artifact doesn't fall into the wrong hands."
    },
    {
        "id": 114472,
        "poster_path": "/3rINdUPSy9AklJg74jWHOyUXuZd.jpg",
        "overview": "Nick Fury and Talos discover a faction of shapeshifting Skrulls who have been infiltrating Earth for years."
    },
    {
        "id": 346698,
        "title": "Barbie",
        "release_date": "2023-07-19",
        "poster_path": "/cgYg04miVQUAG2FKk3amSnnHzOp.jpg",
        "overview": "Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans."
    },
    {
        "id": 385687,
        "title": "Fast X",
        "release_date": "2023-05-17",
        "poster_path": "/fiVW06jE7z9YnO4trhaMEdclSiC.jpg",
        "overview": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever."
    },
    {
        "id": 569094,
        "title": "Spider-Man: Across the Spider-Verse",
        "release_date": "2023-05-31",
        "poster_path": "/8Vt6mWEReuy4Of61Lnj5Xj704m8.jpg",
        "overview": "After reuniting with Gwen Stacy, Brooklyn’s full-time, friendly neighborhood Spider-Man is catapulted across the Multiverse, where he encounters the Spider Society, a team of Spider-People charged with protecting the Multiverse’s very existence. But when the heroes clash on how to handle a new threat, Miles finds himself pitted against the other Spiders and must set out on his own to save those he loves most."
    },
    {
        "id": 95479,
        "poster_path": "/3yFHMtdhriig4sm1w8oMQfA2gFN.jpg",
        "overview": "Yuji Itadori is a boy with tremendous physical strength, though he lives a completely ordinary high school life. One day, to save a classmate who has been attacked by curses, he eats the finger of Ryomen Sukuna, taking the curse into his own soul. From then on, he shares one body with Ryomen Sukuna. Guided by the most powerful of sorcerers, Satoru Gojo, Itadori is admitted to Tokyo Jujutsu High School, an organization that fights the curses... and thus begins the heroic tale of a boy who became a curse to exorcise a curse, a life from which he could never turn back."
    },
    {
        "id": 502356,
        "title": "The Super Mario Bros. Movie",
        "release_date": "2023-04-05",
        "poster_path": "/qNBAXBIQlnOThrVvA6mA2B5ggV6.jpg",
        "overview": "While working underground to fix a water main, Brooklyn plumbers—and brothers—Mario and Luigi are transported down a mysterious pipe and wander into a magical new world. But when the brothers are separated, Mario embarks on an epic quest to find Luigi."
    },
    {
        "id": 921636,
        "title": "The Out-Laws",
        "release_date": "2023-07-07",
        "poster_path": "/5dliMQ2ODbGNoq0hlefdnuXQxMw.jpg",
        "overview": "A straight-laced bank manager is about to marry the love of his life. When his bank is held up by infamous Ghost Bandits during his wedding week, he believes his future in-laws who just arrived in town, are the infamous Out-Laws."
    },
    {
        "id": 603692,
        "title": "John Wick: Chapter 4",
        "release_date": "2023-03-22",
        "poster_path": "/vZloFAK7NmvMGKE7VkF5UHaz0I.jpg",
        "overview": "With the price on his head ever increasing, John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes."
    },
    {
        "id": 872585,
        "title": "Oppenheimer",
        "release_date": "2023-07-19",
        "poster_path": "/8Gxv8gSFCU0XGDykEGv7zR1n2ua.jpg",
        "overview": "The story of J. Robert Oppenheimer’s role in the development of the atomic bomb during World War II."
    },
    {
        "id": 805320,
        "title": "Bird Box Barcelona",
        "release_date": "2023-07-14",
        "poster_path": "/iTGBHdL12QEpLyRVlykDuiYxzAG.jpg",
        "overview": "After a mysterious force decimates the world’s population, Sebastian must navigate his own survival journey through the desolate streets of Barcelona. As he forms uneasy alliances with other survivors and they try to escape the city, an unexpected and even more sinister threat grows."
    },
    {
        "id": 71912,
        "poster_path": "/cZ0d3rtvXPVvuiX22sP79K3Hmjz.jpg",
        "overview": "Geralt of Rivia, a mutated monster-hunter for hire, journeys toward his destiny in a turbulent world where people often prove more wicked than beasts."
    },
    {
        "id": 76600,
        "title": "Avatar: The Way of Water",
        "release_date": "2022-12-14",
        "poster_path": "/t6HIqrRAclMCA60NsSmeqe9RmNV.jpg",
        "overview": "Set more than a decade after the events of the first film, learn the story of the Sully family (Jake, Neytiri, and their kids), the trouble that follows them, the lengths they go to keep each other safe, the battles they fight to stay alive, and the tragedies they endure."
    },
    {
        "id": 697843,
        "title": "Extraction 2",
        "release_date": "2023-06-09",
        "poster_path": "/7gKI9hpEMcZUQpNgKrkDzJpbnNS.jpg",
        "overview": "Tasked with extracting a family who is at the mercy of a Georgian gangster, Tyler Rake infiltrates one of the world's deadliest prisons in order to save them. But when the extraction gets hot, and the gangster dies in the heat of battle, his equally ruthless brother tracks down Rake and his team to Vienna, in order to get revenge."
    },
    {
        "id": 455476,
        "title": "Knights of the Zodiac",
        "release_date": "2023-04-27",
        "poster_path": "/tBiUXvCqz34GDeuY7jK14QQdtat.jpg",
        "overview": "When a headstrong street orphan, Seiya, in search of his abducted sister unwittingly taps into hidden powers, he discovers he might be the only person alive who can protect a reincarnated goddess, sent to watch over humanity. Can he let his past go and embrace his destiny to become a Knight of the Zodiac?"
    },
    {
        "id": 30984,
        "poster_path": "/2EewmxXe72ogD0EaWM8gqa0ccIw.jpg",
        "overview": "For as long as he can remember, Ichigo Kurosaki has been able to see ghosts. But when he meets Rukia, a Soul Reaper who battles evil spirits known as Hollows, he finds his life is changed forever. Now, with a newfound wealth of spiritual energy, Ichigo discovers his true calling: to protect the living and the dead from evil."
    }
]